In [110]:
import pandas as pd
import numpy as np

In [111]:
df= pd.read_csv("Data\HARGA RUMAH BADUNG RUMAH 123.csv")

In [112]:
df.columns

Index(['HARGA', 'LT', 'LB', 'JKT', 'JKM', 'GRS', 'KOTA'], dtype='object')

In [113]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   HARGA   1001 non-null   object
 1   LT      1001 non-null   int64
 2   LB      1001 non-null   int64
 3   JKT     1001 non-null   int64
 4   JKM     1001 non-null   int64
 5   GRS     1001 non-null   object
 6   KOTA    1001 non-null   object
dtypes: int64(4), object(3)
memory usage: 54.9+ KB

In [114]:
df

               HARGA    LT   LB  JKT  JKM        GRS    KOTA
0     28,000,000,000  1100  700    5    6        ADA  BADUNG
1     19,000,000,000   824  800    4    4        ADA  BADUNG
2      4,700,000,000   500  400    4    3        ADA  BADUNG
3      4,900,000,000   251  300    5    4        ADA  BADUNG
4     28,000,000,000  1340  575    4    5        ADA  BADUNG
...              ...   ...  ...  ...  ...        ...     ...
996   16,000,000,000   488  550    6    5        ADA  BADUNG
997    4,500,000,000   209  270    4    4        ADA  BADUNG
998   29,000,000,000   692  400    4    3  TIDAK ADA  BADUNG
999    1,700,000,000   102  140    4    3  TIDAK ADA  BADUNG
1000   1,250,000,000    63  110    3    3  TIDAK ADA  BADUNG

[1001 rows x 7 columns]

In [115]:
df.loc[(df["GRS"]=="ADA"),["GRS"]]=1
df.loc[(df["GRS"]=="TIDAK ADA"),["GRS"]]=0

In [116]:
df.loc[(df["GRS"]==0),["GRS"]]

     GRS
8      0
9      0
29     0
66     0
80     0
...   ..
984    0
992    0
998    0
999    0
1000   0

[222 rows x 1 columns]

In [117]:
df.describe()

                LT            LB          JKT          JKM
count  1001.000000   1001.000000  1001.000000  1001.000000
mean    530.504496    487.275724     4.457542     3.940060
std     531.069773    452.872262     2.004606     1.903261
min      22.000000     38.000000     1.000000     1.000000
25%     220.000000    300.000000     4.000000     3.000000
50%     400.000000    411.000000     4.000000     4.000000
75%     677.000000    600.000000     5.000000     4.000000
max    6790.000000  10000.000000    27.000000    27.000000

jika diliat pada 
- LT bahwa memiliki nilai STD > MEAN yang mana berarti sebuah field memiliki nilai yang condong terhadap penyebaran data dari mean

- di field lainnya memiliki value yang STD < MEAN yang berarti sebuah field memilii niali yang condong terhadap penyebaran data dari mean

In [152]:
# evaluation the info about the df 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   HARGA   1001 non-null   int64
 1   LT      1001 non-null   int64
 2   LB      1001 non-null   int64
 3   JKT     1001 non-null   int64
 4   JKM     1001 non-null   int64
 5   GRS     1001 non-null   int64
 6   KOTA    1001 non-null   object
dtypes: int64(6), object(1)
memory usage: 54.9+ KB

Thats data have analisis:

-> 3 data categorical 

-> Non missing value

In [119]:
# Cleaning data by per issue
backup = df.copy()

In [120]:
# convert GRS to numerical value
df["GRS"] = df["GRS"].astype(np.int64)

In [ ]:
# convert to Harga to numerical value
df["HARGA"]= df["HARGA"].str.replace(',','').astype(np.longlong)

In [154]:
# Analisis the Kota filed
df['KOTA'].unique()
# only have one value

array(['BADUNG'], dtype=object)

In [155]:
# extracting the traing data
X = df[["LT","LB","JKT","JKM","GRS","KOTA"]]
y = df["HARGA"]

In [156]:
# explain the extracting data
X

        LT   LB  JKT  JKM  GRS    KOTA
0     1100  700    5    6    1  BADUNG
1      824  800    4    4    1  BADUNG
2      500  400    4    3    1  BADUNG
3      251  300    5    4    1  BADUNG
4     1340  575    4    5    1  BADUNG
...    ...  ...  ...  ...  ...     ...
996    488  550    6    5    1  BADUNG
997    209  270    4    4    1  BADUNG
998    692  400    4    3    0  BADUNG
999    102  140    4    3    0  BADUNG
1000    63  110    3    3    0  BADUNG

[1001 rows x 6 columns]

In [157]:
y

0       28000000000
1       19000000000
2        4700000000
3        4900000000
4       28000000000
           ...
996     16000000000
997      4500000000
998     29000000000
999      1700000000
1000     1250000000
Name: HARGA, Length: 1001, dtype: int64

yg penting shapenya itu sama karena pada train yang mana data train x dengan train y harus punya bobot yang sama ataupun pada data testing

In [158]:
df

            HARGA    LT   LB  JKT  JKM  GRS    KOTA
0     28000000000  1100  700    5    6    1  BADUNG
1     19000000000   824  800    4    4    1  BADUNG
2      4700000000   500  400    4    3    1  BADUNG
3      4900000000   251  300    5    4    1  BADUNG
4     28000000000  1340  575    4    5    1  BADUNG
...           ...   ...  ...  ...  ...  ...     ...
996   16000000000   488  550    6    5    1  BADUNG
997    4500000000   209  270    4    4    1  BADUNG
998   29000000000   692  400    4    3    0  BADUNG
999    1700000000   102  140    4    3    0  BADUNG
1000   1250000000    63  110    3    3    0  BADUNG

[1001 rows x 7 columns]

# Cleaned Data

In [159]:
# convert the clan data to the csv
df.to_csv("Data/Cleaned_House_Data.csv")